# PANDAS

## The Series Data Structure

In [4]:
import pandas as pd

In [6]:
number = [1, 2, 3]
pd.Series(number)

0    1
1    2
2    3
dtype: int64

In [8]:
val = ['Orange', 3, None]
pd.Series(val)

0    Orange
1         3
2      None
dtype: object

In [9]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
sports = {'Archery': 'Ghutan',
          'Golf': 'Scotland',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Ghutan
Golf            Scotland
Taekwondo    South Korea
dtype: object

In [8]:
s.index

Index(['Archery', 'Golf', 'Taekwondo'], dtype='object')

In [13]:
s = pd.Series(['tiger', 'bear', 'moose'], index = ['india', 'america', 'canada'])
s

india      tiger
america     bear
canada     moose
dtype: object

# Querying a Pandas Series

In [20]:
currency = {'Nigeria' : 'Naira',
           'China' : 'Yuan',
           'Argentina' : 'Argentine Peso',
           'Cyprus' : 'Euro'}
s = pd.Series(currency)
s

Nigeria               Naira
China                  Yuan
Argentina    Argentina Peso
Cyprus                 Euro
dtype: object

In [21]:
s.iloc[2]

'Argentina Peso'

In [22]:
s.iloc[3]

'Euro'

In [24]:
s.loc['Nigeria']

'Naira'

In [25]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [31]:
total = 0
for item in s:
    total = total + item
    
print(total)

324.0

In [40]:
import numpy as np
total = np.sum(s)
print (total)

324.0

In [44]:
len(s)

4

In [48]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [49]:
s.loc['Animal'] = 'Bear'
s

0            1
1            2
2            3
Animal    Bear
dtype: object

# The DataFrame Data Structure

In [30]:
detail_1 = pd.Series({'Name': 'Chris',
                     'Email': 'chris@d.com',
                     'Password': 'chris123',
                     'Country': 'usa'})
detail_2 = pd.Series({'Name': 'Kevyn',
                     'Email': 'kevyn@sds.com',
                     'Password': 'pleasehash',
                     'Country': 'usa'})
detail_3 = pd.Series({'Name': 'Vinod',
                     'Email': 'homeboi@mail.com',
                     'Password': 'vinodboy123',
                     'Country': 'Mexico'})
df = pd.DataFrame([detail_1, detail_2, detail_3], index = ['location 1', 'location 1', 'location 2'])
df

             Name             Email     Password Country
location 1  Chris       chris@d.com     chris123     usa
location 1  Kevyn     kevyn@sds.com   pleasehash     usa
location 2  Vinod  homeboi@mail.com  vinodboy123  Mexico

In [7]:
df.loc['location 2']

Name                   Vinod
Email       homeboi@mail.com
Password         vinodboy123
Country               Mexico
Name: location 2, dtype: object

In [10]:
df.loc['location 1', 'Email']

location 1      chris@d.com
location 1    kevyn@sds.com
Name: Email, dtype: object

In [11]:
df.T

           location 1     location 1        location 2
Name            Chris          Kevyn             Vinod
Email     chris@d.com  kevyn@sds.com  homeboi@mail.com
Password     chris123     pleasehash       vinodboy123
Country           usa            usa            Mexico

In [18]:
df.T.loc['Email']

location 1         chris@d.com
location 1       kevyn@sds.com
location 2    homeboi@mail.com
Name: Email, dtype: object

In [19]:
df.loc[:, ['Name', 'Password']]

             Name     Password
location 1  Chris     chris123
location 1  Kevyn   pleasehash
location 2  Vinod  vinodboy123

# Dropping a Column from a DataFrame

In [32]:
df.drop(['location 2']) #It will drop the Row

             Name          Email    Password Country
location 1  Chris    chris@d.com    chris123     usa
location 1  Kevyn  kevyn@sds.com  pleasehash     usa

In [31]:
df

             Name             Email     Password Country
location 1  Chris       chris@d.com     chris123     usa
location 1  Kevyn     kevyn@sds.com   pleasehash     usa
location 2  Vinod  homeboi@mail.com  vinodboy123  Mexico

In [33]:
df.drop(['Name'], axis = 1) #axis = 1 makes the drop in the column

                       Email     Password Country
location 1       chris@d.com     chris123     usa
location 1     kevyn@sds.com   pleasehash     usa
location 2  homeboi@mail.com  vinodboy123  Mexico

# Data Frame Indexing and Loading

In [34]:
df

             Name             Email     Password Country
location 1  Chris       chris@d.com     chris123     usa
location 1  Kevyn     kevyn@sds.com   pleasehash     usa
location 2  Vinod  homeboi@mail.com  vinodboy123  Mexico

In [35]:
name = df['Name']
name

location 1    Chris
location 1    Kevyn
location 2    Vinod
Name: Name, dtype: object

In [37]:
name = df['Name']
name

location 1    Chris
location 1    Kevyn
location 2    Vinod
Name: Name, dtype: object

In [41]:
password = df['Password']
password

location 1       chris123
location 1     pleasehash
location 2    vinodboy123
Name: Password, dtype: object

In [42]:
password = df['Password'].loc['location 1']
password

location 1      chris123
location 1    pleasehash
Name: Password, dtype: object

# Reading Dataset with Pandas

In [3]:
import pandas as pd

In [ ]:
#Import the CSV file and work on it

## QUERING A DATASET

# MISSING VALUES